package ru.geekbrains.firstproject;

//Задание 1
//        Написать небольшую программу-игру.
//        Компьютер загадывает число(от 0 до 9), пользователь должен его угадать. На отгадывание дается три попытки.
//        Если игра закончилась(угадали число, или закончились попытки), компьютер должен спросить - хочет ли игрок сыграть
//        еще один раунд. Можно подсчитывать количество угаданных чисел.
//        Для формирования случайного числа от 0 до 9 можно воспользоваться:
//        int x = (int)(Math.random() * 10);
//        Задание со звездочкой
//        Создать массив из слов:
//        apple, orange, lemon, banana, apricot, avocado, broccoli, carrot,
//        cherry, garlic, grape, melon, leak, kiwi, mango, mushroom, nut,
//        olive, pea, peanut, pear, pepper, pineapple, pumpkin, potato
//        При запуске программы компьютер загадывает слово.
//        Запрашиваем у пользователя слово и сравниваем его с загаданным.
//        После ввода пользователем слова, мы должны сказать угадал он слово, или нет.
//        Если слово не угадано, необходимо показать буквы которые стоят на своих местах.
//        apple - загаданное
//        apricot - ответ игрока
//        ap################## (20 символов, чтобы пользователь не мог узнать длину слова)
//        Для сравнения двух слов посимвольно, можно пользоваться:
//        String str = "Apple";
//        str.charAt(0); - метод, вернет char - символ, который стоит в слове str на первой позиции
//        Играем до тех пор, пока игрок не отгадает слово
//        Используем только маленькие буквы
//        Делаете только одно

public class Lesson3 {

    public static void main  (String[] args) {

    }

}
